Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་སྦྱིན་པ་ནི་བྱམས་པའི་རྗེས་སུ་ཞུགས་པའི་སེམས་ཀྱིས་བཏང་བའོ། ། སྙན་པར་སྨྲ་བ་ནི་དགའ་ཞིང་རབ་ཏུ་དགའ་བ་ལ་ཞུགས་པའི་སེམས་མི་གཏོང་བའོ། ། དོན་བྱེད་པ་ནི་སྙིང་རྗེ་ཆེན་པོའི་གོ་ཆ་བགོས་པའི་སེམས་ཀྱིས་སེམས་ཅན་གྱི་བྱ་བ་ལ་བརྩོན་པའོ། ། དོན་མཚུངས་པ་ནི་བཏང་སྙོམས་ལ་མཐོན་དམན་མེད་ཅིང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་བསྔོ་བའི་སེམས་སོ། །
en: “Furthermore, generosity is to practice renunciation with an attitude of love. Pleasant speech is to abandon an attitude of joy and delight. Conscientiousness is persevering with an attitude that is protected by the armor of great compassion, for the sake of sentient beings. Egalitarianism is to remain equanimous, without ups and downs, with one’s mind dedicated to omniscient knowledge.

source: གཞན་ཡང་སྦྱིན་པ་ནི་གང་ཆོས་ཀྱིས་བཙལ་བའི་ལོངས་སྤྱོད་ཡོངས་སུ་གཏོང་བའོ། ། སྙན་པར་སྨྲ་བ་ནི་གང་ལ་སྦྱིན་པར་བྱེད་པ་དེ་ཆོས་ལ་འཛུད་པའོ། ། དོན་བྱེད་པ་ནི་གང་བདག་གི་དོན་དང་གཞན་གྱི་དོན་ཡང་དག་པར་སྐྱེད་པའོ། ། དོན་མཚུངས་པ་ནི་གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའོ། །
en: “Furthermore, what is known as generosity is to give up riches in one’s search for the Dharma. Pleasant speech is to create a connection between those to whom one is generous and the Dharma. Conscientiousness is bringing benefit to oneself and to others. Egalitarianism is motivating oneself to attain the state of omniscience for the sake of all sentient beings.

source: གཞན་ཡང་སྦྱིན་པ་ནི་གང་ནང་དང་ཕྱིའི་ཆོས་རྣམས་ལ་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའོ། ། སྙན་པར་སྨྲ་བ་ནི་གང་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་ཡེ་ཤེས་ལ་སློབ་དཔོན་གྱི་དཔེ་མཁྱུད་མེད་པའོ། ། དོན་བྱེད་པ་ནི་གང་གིས་བདག་གི་དོན་བཏང་སྟེ། གཞན་གྱི་དོན་མྱོང་བར་བྱེད་པའོ། ། དོན་མཚུངས་པ་ཉིད་ནི་བྱང་ཆུབ་ལག་ཏུ་འོངས་པ་ལ་བལྟས་ནས་གཞན་ལ་སྦྱིན་པ་ན་ཡིད་མི་བདེ་བར་མི་འགྱུར་བའོ། །
en: “Furthermore, generosity is giving up any sense of ownership of internal and external phenomena. Pleasant speech is not being a tight-fisted teacher when it comes to one’s knowledge of the qualities all phenomena. Conscientiousness is letting go of one’s own goals and facilitating the goals of others. Egalitarianism is not feeling bad about giving one’s own possessions to others.

source: དེ་ལ་ཆོས་སྦྱིན་པ་གང་ཞེ་ན། གང་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་སྟོན་པའོ། ། དེ་ལ་སྙན་པར་སྨྲ་བ་གང་ཞེ་ན། གང་ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པའོ། ། དོན་བྱེད་པ་ནི་གང་ཕ་རོལ་ལ་ལུང་འབོགས་པ་དང་། ཁ་དོན་བྱེད་པ་དང་། འཆད་པ་དང་། སྟོན་པ་ལ་མི་སྐྱོ་བའོ། ། དེ་ལ་དོན་མཚུངས་པ་ནི་གང་ཞེ་ན། གང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དང་མ་བྲལ་བར་ཆོས་ལ་འཛུད་པའོ། །
en: “What is the gift of Dharma? It is to teach the Dharma according to tradition. Pleasant speech is to elucidate the Dharma without any expectation of reward. Conscientiousness is to not tire of reciting, presenting, and explaining the Dharma. Egalitarianism is to not be separated from the mind of omniscience as one engages in the development of the Dharma.

source: གཞན་ཡང་སྦྱིན་པ་ནི་ཆོས་ཉེ་བར་འོངས་པ་རྣམས་ལ་མི་གཡེང་བར་སྟོན་པའོ། ། དེ་ལ་སྙན་པར་སྨྲ་བ་ནི་གང་རྒྱང་རིང་པོར་ཡང་སོང་སྟེ་དམ་པའི་ཆོས་སྟོན་པའོ། ། དེ་ལ་དོན་བྱེད་པ་ནི་གང་ཆོས་འདོད་པས་ཆོས་སྨྲ་བ་རྣམས་གོས་དང་བྲལ་བར་གྱུར་ཏམ། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་དང་བྲལ་བར་གྱུར་ཏམ། ཅི་དགོས་པར་གྱུར་པ་དེ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་པའོ། ། དོན་མཚུངས་པ་ཉིད་ནི་ལྷག་པའི་བསམ་པར་ཞུགས་པའི་རྒྱུད་ཀྱི་ཆོས་སྟོན་པའོ། །
en: “Furthermore, generosity is to be untiring in teaching whoever comes to listen to the teachings. Pleasant speech is to elucidate the true Dharma even when one has just arrived from far away. Conscientiousness is to part with clothing, to part with sustenance, bedding, seats, medicine for the sick, and utensils, to part with anything that one may have for the sake of Dharma and give it all to those who desire the Dharma. Egalitarianism is to teach the Dharma with sustained excellent intentions.

source: གཞན་ཡང་ཆོས་ཀྱི་སྦྱིན་པ་ནི་གང་སྦྱིན་པ་ཐམས་ཅད་ཀྱི་ནང་ན་མཆོག་ཏུ་ཤེས་ནས་ཆོས་སྦྱིན་པར་བྱེད་པའོ། ། དེ་ལ་སྙན་པར་སྨྲ་བ་ནི་གང་ཕན་པའི་དངོས་པོའི་ཕྱིར་སྟོན་པའོ། ། དོན་བྱེད་པ་ནི་གང་དོན་ལ་རྟོན་གྱི་ཚིག་འབྲུ་ལ་མི་རྟོན་པའོ། ། དེ་ལ་དོན་མཚུངས་པ་ནི་གང་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྐང་བའི་ཕྱིར་ཆོས་སྟོན་པའོ། །
en: “Furthermore, the gift of Dharma is to consider the gift of Dharma to be the best of all gifts when one gives it. Pleasant speech is to teach in order to bring about beneficial states of being. Conscientiousness is to rely on the meaning and not on the words. Egalitarianism is to teach the Dharma in order to perfect the qualities of a buddha.

source: གཞན་ཡང་སྦྱིན་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། ། སྙན་པར་སྨྲ་བ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། ། དོན་བྱེད་པ་ནི་གང་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། ། དོན་མཚུངས་པ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Furthermore, the gift of Dharma is the perfection of generosity. Pleasant speech is the perfection of morality and the perfection of patient acceptance. Conscientiousness is the perfection of vigor. Egalitarianism is the perfection of meditation and the perfection of wisdom.

source: གཞན་ཡང་སྦྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་རྣམས་ཀྱིའོ། །སྙན་པར་སྨྲ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་ལ་ཞུགས་པ་རྣམས་ཀྱིའོ། །དོན་བྱེད་པ་ནི་གང་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་རྣམས་ཀྱིའོ། །དོན་མཚུངས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་རྣམས་ཀྱིའོ། །
en: “Furthermore, generosity is the initial arising of the mind of awakening in bodhisatvas. Pleasant speech is the bodhisatvas’ engagement with practice. Conscientiousness is the bodhisatvas’ irreversibility. Egalitarianism is when the bodhisatvas are bound to only one more birth.

source: གཞན་ཡང་སྦྱིན་པ་ནི་བྱང་ཆུབ་ཀྱི་རྩ་བའི་གནས་སོ། ། སྙན་པར་སྨྲ་བ་ནི་བྱང་ཆུབ་ཀྱི་མྱུ་གུ་ཡོངས་སུ་རྫོགས་པའོ། ། དོན་བྱེད་པ་ནི་བྱང་ཆུབ་ཀྱི་མེ་ཏོག་ཡོངས་སུ་གྲུབ་པའོ། ། དོན་མཚུངས་པར་བྱེད་པ་ནི་བྱང་ཆུབ་ཀྱི་འབྲས་བུ་མངོན་པར་གྲུབ་པ་སྟེ།
en: “Furthermore, the gift of Dharma is the root that forms the foundation of awakening. Pleasant speech is the developing sprout of awakening. Conscientiousness is the blossoming flower of awakening. Egalitarianism is the appearance of the fruit of awakening.

source: དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསྡུ་བའི་དངོས་པོ་རྣམ་པ་བཞིའོ། ། བསྡུ་བའི་དངོས་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡུན་རིང་པོར་སེམས་ཅན་རྣམས་ཡང་དག་པར་སྡུད་ཅིང་བྱང་ཆུབ་ཏུ་སྤྱོད་དེ། དེ་ནི་བསྡུ་བའི་དངོས་པོའི་རྗེས་སུ་འཇུག་པ་ཞེས་བྱའོ། །
en: “These are the bodhisatvas’ four methods for bringing people together. By employing these four methods, the bodhisatvas, the great beings, attract sentient beings to the practice of awakening for long periods of time. This is what is meant by employing the methods for bringing people together.

source: དེ་ལྟ་བས་ན་ཚད་མེད་པ་དེ་དག་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་དག་དང་། བསྡུ་བའི་དངོས་པོ་དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་ལམ་ཞེས་བྱའོ། །
en: “These methods for bringing people together, then, which cannot be calculated, which have no measure, and which are the perfections, are what are known as the path of awakening.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕུང་པོ་ཆེན་པོ་དེས་གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་ལ་བྱང་ཆུབ་ཀྱི་ལམ་དེ་ཡང་བཤད། འདས་པ་དང་། མ་བྱོན་པ་དང་། དེ་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྔགས་པ་ཡང་བརྗོད་དེ།
en: “So it was, Śāriputra, that the Lord, the tathāgata, arhat, fully accomplished Buddha Mahāskandha, revealed the path of awakening to Vīryacarita, and that he explained the nature of the lords, the buddhas, of the past, the future, and the present.

source: ཤཱ་རིའི་བུ་དེ་ནས་གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་ཆེན་པོ་ལས་བྱང་ཆུབ་ཀྱི་ལམ་དེ་ཐོས། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡོན་ཏན་ཡང་ཐོས་ནས་དགའ་བ་དང་། མགུ་བ་རྒྱ་ཆེན་པོ་རྙེད་པར་གྱུར་ཏོ། ། དེ་དགའ་བ་དང་། མགུ་བ་རྒྱ་ཆེན་པོ་རྙེད་ནས་ བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕུང་པོ་ཆེན་པོ་དེ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་ལོ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་ཏུ་འདི་ལྟ་སྟེ། ན་བཟའ་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། རིམ་གྲོར་བྱས། མཆོད་པར་བྱས་ནས་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་ཏོ། །
en: “Śāriputra, the prince Vīryacarita learned the path of awakening from the Lord, the Tathāgata Mahāskandha. He learned the nature that defines the lords, the buddhas, of the past, the future, and the present, and he was immensely happy and delighted. Completely happy and delighted, he praised, venerated, honored, and worshiped the Lord, the tathāgata, arhat, fully accomplished Buddha Mahāskandha, together with his assembly of śrāvakas, for nine hundred sixty million years, offering clothing, sustenance, bedding, seats, medicine for the sick, and utensils, and expressed his aspiration to attain awakening, but the Lord, the Tathāgata Mahāskandha did not make any predictions of unsurpassed perfect awakening.

source: ཤཱ་རིའི་བུ་དེའི་ཚེ་དེའི་དུས་ན་གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་ཅེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་ཐེ་ཚོམ་དང་ཡིད་གཉིས་ཟ་ན་ དེ་ལྟར་མི་བལྟའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་ཚེ་དེའི་དུས་ན་ང་གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་ཅེས་བྱ་བར་གྱུར་ཏེ། ངས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་ཆེན་པོ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་ན་བཟའ་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་ལོ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་ཏུ་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། རིམ་གྲོར་བྱས། མཆོད་པར་བྱས་ནས་ བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་ཀྱང་། ང་ལ་བཅོམ་ལྡན་འདས་དེས་གཞོན་ནུ་ཁྱོད་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ། ། ཞེས་ལུང་མ་བསྟན་ཏོ། །
en: “Śāriputra, no one should entertain any doubt, any uncertainty, about whether this prince named Vīryacarita who appeared at this time, on this occasion, was anyone else. Why is this? It is because it was I who was that prince named Vīryacarita who appeared at that time, on that occasion. It was I who praised, venerated, honored, and worshiped the Lord, the Tathāgata Mahāskandha, and his assembly of śrāvakas for nine hundred sixty million years and expressed my aspiration to attain awakening. It was me whose awakening the Lord did not predict, saying, ‘In the future, you will become a tathāgata, an arhat, a fully accomplished buddha.’

source: ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་བཅོམ་ལྡན་འདས་འོད་འཕྲོའི་ཕུང་པོ་ཆེན་པོ་དེ་ཚུན་ཆད་བསྐལ་པ་གྲངས་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཀོན་མཆོག་ཡན་ལག་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུའོ། །ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དཀོན་མཆོག་ཡན་ལག་གི་ཉན་ཐོས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུའི་ཉན་ཐོས་རྣམས་ཀྱི་ཉན་ཐོས་འདུས་པ་ཆེན་པོ་བྱུང་སྟེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ་ནས་སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའི་བར་ཤ་སྟག་གོ།
en: “So it was, Śāriputra, that innumerable eons after the Lord Mahāskandha, a tathāgata, arhat, fully accomplished buddha by the name of Ratnāṅga appeared in the world, and so forth. He was awakened, a lord. The Tathāgata Ratnāṅga, Śāriputra, had a great following of eight trillion śrāvakas, all of whom were arhats who had eliminated the defilements, who were free from vices, who were powerful, and so forth, and who had reached the very highest level of complete mastery of the mind.

source: ཤཱ་རིའི་བུ་ཡང་དེའི་ཚེ་ན་རྒྱལ་པོ་མཛེས་པར་སྣང་བ་ཞེས་བྱ་བ་མཐའ་བཞིར་རྣམ་པར་རྒྱལ་བ། འཁོར་ལོས་སྒྱུར་བ། ཆོས་དང་ལྡན་པ། ཆོས་ཀྱི་རྒྱལ་པོ་ཡུལ་གྱི་མཐུ་དང་བརྩོན་པ་ཐོབ་པ། རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ དེའི་རིན་པོ་ཆེ་སྣ་བདུན་བྱུང་བ་ནི་འདི་དག་གོ ། འདི་ལྟ་སྟེ། འཁོར་ལོ་རིན་པོ་ཆེ་ནས་བློན་པོ་རིན་པོ་ཆེའི་བར་དུ་བདུན་ཏེ། མངོན་པར་བཏུལ་ནས་གནས་པའི་བར་དུའོ། །
en: “At that time, Śāriputra, there was a king by the name of Sudarśana, a king of the four quarters, a just king who ruled according to the Dharma and was energetic and diligent on behalf of his populace and in possession of the seven precious implements. The seven implements he possessed were the precious wheel, and so forth, up to and including the precious minister. He conquered, and so forth, and he governed.

source: ཤཱ་རིའི་བུ་རྒྱལ་པོ་མཛེས་པར་སྣང་བ་དེའི་ཕོ་བྲང་ནི་གྲོང་ཁྱེར་འཛམ་བུའི་ཆུ་བོའི་གསེར་ཞེས་བྱ་སྟེ། ཤར་ཕྱོགས་ནས་ནུབ་ཕྱོགས་སུ་ཆུར་ནི་དཔག་ཚད་བཅུ་གཉིས། ལྷོ་ཕྱོགས་ནས་བྱང་ཆུབ་ཕྱོགས་སུ་ཞེང་དུ་ནི་དཔག་ཚད་བདུན་ཡོད་དེ། འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། དགའ་བ་དང་། སྐྱེ་བོ་མང་པོ་དང་། མིས་གང་བར་གྱུར་ཏོ། །
en: “Śāriputra, the king Sudarśana’s royal capital was called Jāmbūnada. From east to west it stretched for twelve yojanas. From south to north it was seven yojanas across. It was wealthy, thriving, prosperous, well supplied, pleasant, and bustling with throngs of people.

source: ཡང་དེའི་ཚེ་ན་ཚོང་དཔོན་ཤེས་རབ་བཟང་ཞེས་བྱ་བ་ཕྱུག་པ། ནོར་མང་བ། ལོངས་སྤྱོད་ཆེ་བ་ནས་མཛོད་དང་བང་བས་ཡོངས་སུ་གང་བའི་བར་དུ་རྒྱས་པར་བྱ་སྟེ སྔོན་གྱི་སངས་རྒྱས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། སྔོན་གྱི་སངས་རྒྱས་ལ་བྱ་བ་བྱས་པ་ཞིག་བྱུང་ངོ་། །
en: “At that time, there was a merchant by the name of Suprajña. He was wealthy, he had great riches, and so forth, and he had storerooms filled with riches and treasure. He had developed roots of virtue in the presence of past buddhas. He had served the buddhas of the past.

source: ཤཱ་རིའི་བུ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཀོན་མཆོག་ཡན་ལག་དེས་ཚོང་དཔོན་ཤེས་རབ་བཟང་གི་བསམ་པ་ལ་བརྟགས་ནས། ཀྱེ་མའོ་ཚོང་དཔོན་ཤེས་རབ་བཟང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་སྣོད་དུ་རུང་ངོ་། ། ཀྱེ་མའོ་ཚོང་དཔོན་ཤེས་རབ་བཟང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་དུ་གྱུར་ཏོ་སྙམ་དུ་དགོངས་ཏེ། སྣོད་དུ་གྱུར་པར་མཁྱེན་ནས་ཚོང་དཔོན་ཤེས་རབ་བཟང་ག་ལ་བ་དེར་གཤེགས་ཏེ་ཕྱིན་ནས་རྫུ་འཕྲུལ་གྱིས་སྟེང་གི་བར་སྣང་ལ་སྐྱིལ་མོ་ཀྲུང་དུ་བཞུགས་ནས་བྱང་ཆུབ་ཀྱི་ལམ་ཡང་བཤད། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྔགས་པ་ཡང་བརྗོད་དོ། །
en: “It so happened, Śāriputra, that the Lord, the Tathāgata Ratnāṅga, saw the intentions of the merchant Suprajña, and it occurred to him, ‘This merchant, Suprajña, is truly a suitable recipient for the cycle of teachings contained in The Collected Teachings on the Bodhisatva.’ Having concluded that he was a suitable recipient, he approached the merchant Suprajña, seated himself magically on a throne floating in midair, and presented the path to awakening, describing the nature of the lords, the buddhas, of the past, the future, and the present.

source: ཤཱ་རིའི་བུ་དེ་བས་ན་ཚོང་དཔོན་ཤེས་རབ་བཟང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལམ་འདི་ཡང་ཐོས། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྔགས་པ་ཡང་ཐོས་ནས་ དགའ་བ་དང་། མགུ་བ་དང་། མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་ཐོབ་པར་གྱུར་ཏོ། ། དེ་དགའ་བ་དང་། མགུ་བ་དང་། མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་ཐོབ་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཀོན་མཆོག་ཡན་ལག་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་ལ་ལོ་སྟོང་དུ་འདི་ལྟ་སྟེ། ན་བཟའ་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་ཀྱིས་བསྙེན་བཀུར་བྱས། བླ་མར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ནས་ བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཀོན་མཆོག་ཡན་ལག་དེས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་ཏོ། །
en: “Then, Śāriputra, as the merchant Suprajña learned about the path of the bodhisatvas, the great beings, as he learned about the nature of the lords, the buddhas, of the past, the future, and the present, he became happy, elated, and delighted. Being happy, elated, and delighted, he praised, venerated, honored, and worshiped the Lord, the tathāgata, arhat, fully accomplished Buddha Ratnāṅga, and his assembly of śrāvakas for a thousand years with clothing, sustenance, bedding, seats, medicine for the sick, and utensils, and he expressed his aspiration to attain unsurpassed perfect awakening. Still, the Lord, the Tathāgata Ratnāṅga did not make any predictions of unsurpassed perfect awakening.

source: ཤཱ་རིའི་བུ་ཡང་དེའི་ཚེ་དེའི་དུས་ན་ཚོང་དཔོན་ཤེས་རབ་བཟང་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཐེ་ཚོམ་དང་། ཡིད་གཉིས་ཟ་ན་ དེ་ལྟར་མི་ལྟའོ། ། དེའི་ཚེ་དེའི་དུས་ན་ང་ཚོང་དཔོན་ཤེས་རབ་བཟང་ཞེས་བྱ་བར་གྱུར་ཏེ། ངས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཀོན་མཆོག་ཡན་ལག་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་ལ་ལོ་སྟོང་དུ་ན་བཟའ་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ཏེ། བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཀོན་མཆོག་ཡན་ལག་དེས། ང་ལ་ཁྱོད་མ་འོངས་པའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ། ། ཞེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་ཏོ། །
en: “Śāriputra, no one should entertain any doubt, any uncertainty, about whether this merchant named Suprajña, who appeared at this time, on this occasion, was anyone else. I was that merchant named Suprajña, who appeared at that time, on that occasion. It was I who praised, venerated, honored, and worshiped the Lord, the Tathāgata Ratnāṅga, and his assembly of śrāvakas for a thousand years and expressed my aspiration to attain awakening. It was me who the Lord, the Tathāgata Ratnāṅga, did not predict to unsurpassed perfect awakening, saying, ‘In the future, you will become a tathāgata, an arhat, a fully accomplished buddha.’

source: ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་དཀོན་མཆོག་ཡན་ལག་ཚུན་ཆད་བསྐལ་པ་གྲངས་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། ། ཡང་དེའི་ཚེ་ན་རྒྱལ་པོ་དགྲ་ཐུལ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། ཤཱ་རིའི་བུ་རྒྱལ་པོ་དགྲ་ཐུལ་གྱི་གྲོང་ཁྱེར་པད་མ་ཅན་ཞེས་བྱ་བ་འབྱོར་པ། རྒྱས་པ། བདེ་བ། ལོ་ལེགས་པ། དགའ་བ། སྐྱེ་བོ་མང་པོ་དང་མིས་གང་བ་ཞིག་ཡོད་དེ། །
en: “Then, Śāriputra, innumerable eons after Ratnāṅga, a tathāgata by the name of Dīpaṅkara appeared in the world. At this time there was a king by the name of Jitaśatru, and the capital city of King Jitaśatru, Śāriputra, was called Padmāvatī. It was wealthy, thriving, prosperous, well supplied, pleasant, and bustling with throngs of people.

source: ཤཱ་རིའི་བུ་རྒྱལ་པོ་དགྲ་ཐུལ་གྱི་བྲམ་ཟེ་མར་མེའི་བདག་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་བུ་ཕྱུག་པ། ནོར་མང་བ། ལོངས་སྤྱོད་ཆེ་བ་ནས་མཛོད་དང་། བང་བའི་བར་དུ་ཡོངས་སུ་གང་བ་ཞིག་བྱུང་བ་དེ་རྒྱལ་པོ་དགྲ་ཐུལ་ལ་དབེན་ཅིང་ཕངས་པ་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་སྟེ། མཐོང་ན་མི་འཐུན་པ་མེད་དེ། ། ཤཱ་རིའི་བུ་བྲམ་ཟེ་མར་མེའི་བདག་པོ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ལ་རྒྱལ་སྲིད་ཕྱེད་བྱིན་ནོ། ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། རྒྱལ་པོ་མར་མེའི་བདག་པོ་རྒྱལ་པོའི་ཕྱེད་བྱེད་པ་ཆོས་ཀྱིས་བྱེད་དེ། ཆོས་མ་ཡིན་པས་ནི་མ་ཡིན་ནོ། །
en: “The king Jitaśatru, Śāriputra, had a brahmin named Dīpapati who was the son of a great noble household. He was wealthy and he had great riches, many possessions, and so forth and storerooms filled with riches and treasure. The king Jitaśatru liked him, loved him, considered him a friend and comfort, and liked to have him close by. So it was, Śāriputra, that the king Jitaśatru gave the great brahmin lord Dīpapati half his kingdom. As a king, Dīpapati ruled half the kingdom according to the Dharma, and not in a way that was contrary to the Dharma.

source: ཡང་ཤཱ་རིའི་བུ་དུས་གཞན་ཞིག་ན་རྒྱལ་པོ་མར་མེའི་བདག་པོ་ལས་བུ་གཟུགས་བཟང་པོ་མཛེས་པ། བལྟ་ན་ སྡུག་པ། ཤིན་ཏུ་བཟང་བ། ཁ་དོག་རྒྱས་པ། མཆོག་དང་ལྡན་པ། ལུས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པ་ཞིག་བྱུང་སྟེ དེའི་ལུས་ཐམས་ཅད་ལས་འོད་བྱུང་བ་ནི་འདི་ལྟ་སྟེ། ཟླ་བའི་དཀྱིལ་འཁོར་ལས་འབྱུང་བ་བཞིན་ཏེ། དེའི་མིང་མར་མར་མེ་མཛད་དུ་བཏགས་སོ། །
en: “The time came, Śāriputra, when a son was born to king Dīpapati. He was beautiful, handsome, pleasant, and possessed the most excellent and splendid features. He had a body adorned with the thirty-two characteristics of a great being. His whole body emitted light, as if it were the disk of the sun. He was given the name Dīpaṅkara.

source: ཤཱ་རིའི་བུ་དེ་ནས་རྒྱལ་པོ་མར་མེའི་བདག་གིས་བྲམ་ཟེ་མཚན་མཁན་ལྟས་ཤེས་པ་རྣམས་བསོགས་ནས་རྒྱལ་པོ་གཞོན་ནུ་མར་མེ་མཛད་བསྟན་པ་དང་། དེ་དག་གིས་དེ་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། ། དེ་ལྟར་རྒྱལ་པོ་མར་མེའི་བདག་པོས་རྒྱལ་བུ་གཞོན་ནུ་མར་མེ་མཛད་མ་མ་དག་ལ་གཏད་དོ། །
en: “Śāriputra, the king Dīpapati had brahmin astrologers, knowers of signs, sent for to look at the prince Dīpaṅkara, and they predicted that he would attain awakening. The king Dīpapati then obtained female nurses for the prince Dīpaṅkara.

source: ཤཱ་རིའི་བུ་དེ་ནས་རིང་པོ་མ་ལོན་པར་རྒྱལ་བུ་མར་མེ་མཛད་གཞོན་ནུ་མཁས་པར་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་འོག་མིན་གྱི་གནས་ནས་མི་སྣང་བར་གྱུར་ནས། བྱང་ཆུབ་སེམས་དཔའ་མར་མེ་མཛད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བྱང་ཆུབ་སེམས་དཔའ་མར་མེ་མཛད་ལ་བསྐོར་བ་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མར་མེ་མཛད་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “After a very short time, Śāriputra, the prince Dīpaṅkara attained the superior abilities. Then, Śāriputra, the divine sons of the pure abodes emanated from the Heaven of Nothing Higher and approached the bodhisatva Dīpaṅkara. They circumambulated the bodhisatva Dīpaṅkara and then spoke these verses to the bodhisatva, the great being, Dīpaṅkara:

source: བཙུན་མོའི་འཁོར་གྱི་ནང་འདིར་ནི། །ཡོན་ཏན་འབྱུང་གནས་གྱུར་པ་མེད། །
en: “ ‘No good qualities will come From living with a royal harem.

source: དྲང་སྲོང་རྒྱལ་མཚན་གནས་ནས་ནི། །བྱང་ཆུབ་དམ་པ་རྟོགས་པར་འགྱུར། །
en: Someone who puts his trust in the banner of the seers Will realize unsurpassed awakening.

source: ལང་ཚོ་མྱུར་དུ་འགྲོ་བ་ནི། །རླུང་གི་ཤུགས་པས་ལྷག་པར་མགྱོགས། ། རྒ་བ་དེ་ནི་གཟུགས་འཇིག་སྟེ། ། འཇིག་རྟེན་ཡིད་དུ་མི་འོང་བ།
en: “ ‘When one is young, one can move swiftly, As fast as the powerful wind, But with age one’s body withers And becomes unattractive to the world.

source: །གྲོགས་པོ་རྒས་པ་མཐུ་ཉམས་ནི། །རབ་ཏུ་འབྱུང་བར་དཀའ་བ་སྟེ། །
en: “ ‘Friends, when age has taken its toll, It will be difficult to become a renunciate.

source: ཁྱོད་ནི་ཤིན་ཏུ་དར་ལ་བབ། །
en: This is the best time of your youth.

source: ཁྱོད་ནི་རྩལ་བའི་དུས་ཡིན་ནོ། །
en: Now is your chance.

source: ལེགས་སོ་ལེགས་སོ་བློ་གྲོས་ཆེ། །
en: It is excellent, excellent, to have a great intellect.

source: མྱུར་དུ་མངོན་པར་བྱུང་ན་ལེགས། །
en: If you go forth quickly, that will be excellent.

source: ཐུབ་བརྟན་བྱང་ཆུབ་རྟོགས་པར་གྱིས།།
en: Be firm in your practice and attain awakening!’

source: ཤཱ་རིའི་བུ་དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མར་མེ་མཛད་ལ་བསྐུལ་བ་དང་། དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་ དེ་ཉིད་ཀྱི་ནུབ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེ་ཉིད་ཀྱི་ནུབ་མོ་དེ་ལྟར་བཅོམ་ལྡན་འདས་མར་མེ་མཛད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་གྱུར་པ་ཆེ་བ་དང་། དགེ་བར་གྲགས་པའི་སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་མངོན་པར་བྱུང་ནས་ རྒྱལ་པོ་དགྲ་ཐུལ་གྱིས་རྒྱལ་པོ་མར་མེའི་བདག་གི་བུས་མ་བསླབས་པར་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་དེ་ཉིད་ཀྱི་ནུབ་མོ་རྒྱ་ཆེར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་པའི་བར་དུ་ཆེ་བ་དང་། དགེ་བར་གྲགས་པའི་སྒྲ་དང་ཚིགས་སུ་བཅད་པ་ཐོས་སོ། ། ཤཱ་རིའི་བུ་དེ་ནས་རྒྱལ་པོ་དགྲ་ཐུལ་གྱིས་རྒྱལ་པོ་མར་མེའི་བདག་ལ་ཁྱོད་ཀྱི་སྲས་རབ་ཏུ་བྱུང་ནས་ བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་བདག་གིས་ཐོས་ཏེ བདག་ནི་ཁྱོད་ཀྱི་སྲས་མར་མེ་མཛད་མཐོང་བར་འཚལ་ལ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཐུགས་བརྩེ་བའི་སླད་དུ་བདག་གི་དྲུང་དུ་གཤེགས་སུ་གསོལ། དེ་སྟེ་མི་གཤེགས་ན་བདག་ཉིད་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དང་བཅས་ཏེ་ མཆིའོ་ཞེས་ཕོ་ཉ་བཏང་བ་དང་།
en: “In this way, Śāriputra, the bodhisatva Dīpaṅkara was spurred on by the gods of the pure abodes, and following his conviction he left the household life behind and became a renunciant. He attained unsurpassed perfect awakening that very same night. At that very moment, verses of praise, words of greatness and goodness, spread forth, saying that Dīpaṅkara was a lord, a tathāgata, an arhat, a fully accomplished buddha, and so forth, that he was awakened, a lord. The king Jitaśatru heard about this, that the son of the king Dīpapati had become an unsurpassed, fully accomplished buddha without training, and that verses of praise about him, words of greatness and goodness proclaiming that he was awakened, a lord, and so forth, were spreading. The king Jitaśatru, Śāriputra, then dispatched a messenger to the king Dīpapati, saying, ‘It has come to my attention that your son has become a renunciant, and that he has realized perfect awakening. I wish to meet your son Dīpaṅkara. I hope that the Lord, the Tathāgata Dīpaṅkara will bestow the grace of a visit upon me. If it should happen that you do not come, I will have to come to you, together with my fourfold army.’
